<template>
    <div class="main-container">
        <div class="important-container">
            <p class="important-container__title">Важно!</p>
            <div class="important-block">
                <div class="important-block__text-container">
                    <p class="important-block__title">Заголовок ааааа</p>
                    <p class="important-block__text">
                        Текст — зафиксированная на каком-либо материальном носителе человеческая мысль; в общем плане связная и полная последовательность символов. Аааааааааааааааааа ааааааааааааааааааааааааааааа аааааа аааааааааааа аааааааааааааааааааааа аааааааааааа аааааа
                        Текст — зафиксированная на каком-либо материальном носителе человеческая мысль; в общем плане связная и полная последовательность символов. Ааааааааааааааааааааааа аааааааааааааааа аааааааааа аааааааааааа аааааааааааааа аааааааааааааааааааа аааааааааа Текст — зафиксированная на каком-либо материальном носителе человеческая мысль; в общем плане связная и полная последовательность символов. Аааааааааа ааааааааааааааааа аааааааааааааааааааааа ааааааааааааа аааааааааааааааааа ааааааааааааааааааа аааааа Текст — зафиксированная на каком-либо материальном носителе человеческая мысль; в общем плане связная и полная последовательность символов. Аааааааааааааа аааааааааааааааааа ааааааааааааааааааа аааааааааааааа ааааааааааааааааа ааааааа аааааааааааааааа Текст — зафиксированная на каком-либо материальном носителе человеческая мысль; в общем плане связная и полная                         </p>
                    </div>
                    <buttton class="button button--purple"
                    @click="$emit('change-component', 'RegistForm')"
                    >
                    Перейти к регистрации
                    <img src="@/assets/img/arrow_icon.svg" alt="">
                    </buttton>
            </div>
        </div>
    </div>
</template>

<script setup>

</script>

<style scoped>
.button img {
  margin-left: 12px;
  width: 23px;
}
</style>