<template>
    <div class="main-container">
        <div class="important-container">
            <p class="important-container__title">Важно!</p>
            <div class="important-block">
                <div class="important-block__text-container">
                    <p class="important-block__title">Пользовательское Соглашение</p>
                    <p class="important-block__text">
                        Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует
                        отношения между владельцем https://dicardz.com/ (далее dicsrdz или
                        Администрация) с одной стороны и пользователем сайта с другой.<br />
                        Веб-приложение dicsrdz не является средством массовой информации.<br />

                        Используя веб-приложение, Вы соглашаетесь с условиями данного соглашения.<br />
                        Если Вы не согласны с условиями данного соглашения, не используйте сайт
                        dicsrdz<br />

                        Права и обязанности сторон<br />
                        Пользователь имеет право:<br />
                        - осуществлять поиск информации в веб-приложении<br />
                        - получать информацию в веб-приложении<br />
                        - создавать информацию для веб-приложения<br />
                        - копировать информацию на другие сайты с указанием источника<br />
                        - требовать от администрации скрытия любой информации о пользователе<br />
                        - требовать от администрации скрытия любой информации переданной
                        пользователем веб-приложению<br />
                        - использовать информацию веб-приложения в личных некоммерческих целях<br />

                        Администрация имеет право:<br />
                        - по своему усмотрению и необходимости создавать, изменять, отменять
                        правила<br />
                        - ограничивать доступ к любой информации на сайте<br />
                        - создавать, изменять, удалять информацию<br />

                        Пользователь обязуется:<br />
                        - обеспечить достоверность предоставляемой информации<br />
                        - обеспечивать сохранность личных данных от доступа третьих лиц<br />
                        - обновлять Персональные данные, предоставленные при регистрации, в случае
                        их изменения<br />
                        - не распространять информацию, которая направлена на пропаганду войны,
                        разжигание национальной, расовой или религиозной ненависти и вражды, а также
                        иной информации, за распространение которой предусмотрена уголовная или
                        административная ответственность<br />
                        - не нарушать работоспособность веб-приложения<br />
                        - не создавать несколько учётных записей в Веб-приложении, если фактически
                        они принадлежат одному и тому же лицу<br />
                        - не совершать действия, направленные на введение других Пользователей в
                        заблуждение<br />
                        - не передавать в пользование свою учетную запись и/или логин и пароль своей
                        учетной записи третьим лицам<br />
                        - не регистрировать учетную запись от имени или вместо другого лица за
                        исключением случаев, предусмотренных законодательством РФ<br />
                        - не размещать материалы рекламного, эротического, порнографического или
                        оскорбительного характера, а также иную информацию, размещение которой
                        запрещено или противоречит нормам действующего законодательства РФ<br />
                        - не использовать скрипты (программы) для автоматизированного сбора
                        информации и/или взаимодействия с Веб-приложением и его Сервисами<br />

                        Администрация обязуется:<br />
                        - поддерживать работоспособность веб-приложения за исключением случаев,
                        когда это невозможно по независящим от Администрации причинам.<br />
                        - осуществлять разностороннюю защиту учетной записи Пользователя<br />
                        - защищать информацию, распространение которой ограничено или запрещено
                        законами путем вынесения предупреждения либо удалением учетной записи
                        пользователя, нарушившего правила<br />
                        - предоставить всю доступную информацию о Пользователе уполномоченным на то
                        органам государственной власти в случаях, установленных законом<br />

                        Ответственность сторон<br />
                        - администрация не несёт ответственность за несовпадение ожидаемых
                        Пользователем и реально полученных услуг<br />
                        - администрация не несет никакой ответственности за услуги, предоставляемые
                        третьими лицами<br />
                        - в случае возникновения форс-мажорной ситуации (боевые действия,
                        чрезвычайное положение, стихийное бедствие и т. д.) Администрация не
                        гарантирует сохранность информации, размещенной Пользователем, а также
                        бесперебойную работу информационного ресурса<br />

                        Условия действия Соглашения<br />
                        Данное Соглашение вступает в силу при регистрации в веб-приложении.<br />
                        Соглашение перестает действовать при появлении его новой версии.<br />
                        Администрация оставляет за собой право в одностороннем порядке изменять
                        данное соглашение по своему усмотрению.<br />
                        Администрация не оповещает пользователей об изменении в Соглашении.<br />
                    </p>
                </div>
                <button
                    class="button button--purple"
                    @click="$emit('change-component', 'RegistForm')"
                >
                    Перейти к регистрации
                    <img src="@/assets/img/arrow_icon.svg" alt="" />
                </button>
            </div>
        </div>
    </div>
</template>

<script setup></script>

<style scoped>
.button img {
    margin-left: 12px;
    width: 23px;
}
</style>
